from pprint import pprint
#====================
#Баскетболисты
#===================

basketball_players = {
    "Майкл Джордан":"1.98",
    "Билл Расселл":"2.08",
    "Оскар Шмидт":"1.98",
    "Джерри Уэст":"1,91",
}
pprint(basketball_players)

#Добавление баскетболиста
basketball_players ["Джерри Уэст"]:[1,91]
pprint(basketball_players)

#Удаление баскетболиста
del basketball_players["Майкл Джордан"]
pprint(basketball_players)

#поиск
pprint(basketball_players["Джерри Уэст"])
pprint(basketball_players.get("Майкл Джордан"))
pprint(basketball_players.get("Оскар Шмидт"))

#Замена

basketball_players["Майкл Джордан"] = "2.5 "

pprint(basketball_players)

#########################
# Вывыд
########################
#
# {'Билл Расселл': '2.08',
#  'Джерри Уэст': '1,91',
#  'Майкл Джордан': '1.98',
#  'Оскар Шмидт': '1.98'}
# {'Билл Расселл': '2.08',
#  'Джерри Уэст': '1,91',
#  'Майкл Джордан': '1.98',
#  'Оскар Шмидт': '1.98'}
# {'Билл Расселл': '2.08', 'Джерри Уэст': '1,91', 'Оскар Шмидт': '1.98'}
# '1,91'
# None
# '1.98'
# {'Билл Расселл': '2.08',
#  'Джерри Уэст': '1,91',
#  'Майкл Джордан': '2.5 ',
#  'Оскар Шмидт': '1.98'}
#
# Process finished with exit code 0






