from pprint import pprint

#======================================
#=============== Фирма ================
#======================================

data = {
    "телефон": 0,
    "e-mail": 1,
    "название должности": 2,
    "номер кабинета": 3,
    "skype": 4
}
firm = {
    "Воскобойников Игорь": [+38096111111, "VIL@gmail.com", "директор", 1, "VIL.live"],
    "Воскобойникова Наталья": [+380672222222, "VNV@gmail.com", "зам директор", 2, "VNV.live"],
    "Титкова Алена": [+380503333333, "TIA@gmail.com", "админимтратор", 3, "TIA.live"],
    "Сорокин Иван": [+380984444444, "SIG@gmail.com", "тренер", 4, "SIGlive"],
    "Герасименко Юлия": [+380505555555, "GYM@gmail.com", "фитнес менеджер", 5, "GYM.live"],

}
pprint(firm)
pprint(firm["Воскобойников Игорь"])

#============ Удаление =============
del firm["Сорокин Иван"]
pprint(firm)

#============== Поиск ==============
pprint(firm["Герасименко Юлия"])
pprint(firm.get("Иванов Иван", "Нет такого сотружника"))
pprint(firm.get("Воскобойникова Наталья"))

#=========== Добавление ============
new_firm = {
    "Сидоров Алексей": [+38050666666, "SDF@gmail.com", "дворник", 0, "SDF.live"]
}
firm.update(new_firm)
pprint(firm)
#=========== Замена данных ============
pprint(firm["Воскобойникова Наталья"])
firm["Воскобойникова Наталья"] = [+380509999999, "VNV@ukr.net", "комерческий директор", 25, "VNV.live"]
pprint(firm)

#############################
#Вывод
############################
# {'Воскобойников Игорь': [38096111111,
#                          'VIL@gmail.com',
#                          'директор',
#                          1,
#                          'VIL.live'],
#  'Воскобойникова Наталья': [380672222222,
#                             'VNV@gmail.com',
#                             'зам директор',
#                             2,
#                             'VNV.live'],
#  'Герасименко Юлия': [380505555555,
#                       'GYM@gmail.com',
#                       'фитнес менеджер',
#                       5,
#                       'GYM.live'],
#  'Сорокин Иван': [380984444444, 'SIG@gmail.com', 'тренер', 4, 'SIGlive'],
#  'Титкова Алена': [380503333333,
#                    'TIA@gmail.com',
#                    'админимтратор',
#                    3,
#                    'TIA.live']}
# [38096111111, 'VIL@gmail.com', 'директор', 1, 'VIL.live']
# {'Воскобойников Игорь': [38096111111,
#                          'VIL@gmail.com',
#                          'директор',
#                          1,
#                          'VIL.live'],
#  'Воскобойникова Наталья': [380672222222,
#                             'VNV@gmail.com',
#                             'зам директор',
#                             2,
#                             'VNV.live'],
#  'Герасименко Юлия': [380505555555,
#                       'GYM@gmail.com',
#                       'фитнес менеджер',
#                       5,
#                       'GYM.live'],
#  'Титкова Алена': [380503333333,
#                    'TIA@gmail.com',
#                    'админимтратор',
#                    3,
#                    'TIA.live']}
# [380505555555, 'GYM@gmail.com', 'фитнес менеджер', 5, 'GYM.live']
# 'Нет такого сотружника'
# [380672222222, 'VNV@gmail.com', 'зам директор', 2, 'VNV.live']
# {'Воскобойников Игорь': [38096111111,
#                          'VIL@gmail.com',
#                          'директор',
#                          1,
#                          'VIL.live'],
#  'Воскобойникова Наталья': [380672222222,
#                             'VNV@gmail.com',
#                             'зам директор',
#                             2,
#                             'VNV.live'],
#  'Герасименко Юлия': [380505555555,
#                       'GYM@gmail.com',
#                       'фитнес менеджер',
#                       5,
#                       'GYM.live'],
#  'Сидоров Алексей': [38050666666, 'SDF@gmail.com', 'дворник', 0, 'SDF.live'],
#  'Титкова Алена': [380503333333,
#                    'TIA@gmail.com',
#                    'админимтратор',
#                    3,
#                    'TIA.live']}
# [380672222222, 'VNV@gmail.com', 'зам директор', 2, 'VNV.live']
# {'Воскобойников Игорь': [38096111111,
#                          'VIL@gmail.com',
#                          'директор',
#                          1,
#                          'VIL.live'],
#  'Воскобойникова Наталья': [380509999999,
#                             'VNV@ukr.net',
#                             'комерческий директор',
#                             25,
#                             'VNV.live'],
#  'Герасименко Юлия': [380505555555,
#                       'GYM@gmail.com',
#                       'фитнес менеджер',
#                       5,
#                       'GYM.live'],
#  'Сидоров Алексей': [38050666666, 'SDF@gmail.com', 'дворник', 0, 'SDF.live'],
#  'Титкова Алена': [380503333333,
#                    'TIA@gmail.com',
#                    'админимтратор',
#                    3,
#                    'TIA.live']}
#
# Process finished with exit code 0