from pprint import pprint

#=====================================
#========= Книжная коллекция =========
#=====================================

data = {
    "автор": 0,
    "жанр": 1,
    "год выпуска": 2,
    "Количество страниц": 3,
    "Издательство": 4
}
book_collection = {
    "Винни Пух": ["Алан Александр Милн", "стихи", 1926, 400, "Лондон ивнинг ньюс"],
    "Властелин Колец": ["Джон Толкин", "фэнтэзи", 1955, 1200, "George Allen & Unwin"],
    "Унесённые ветром": ["Маргарет Митчелл", "роман", 1936, 1080, "New York: Pocket books"],
    "Сто лет одиночества": ["Габриэль Гарсиа Маркес", "магический реализм", 1967, 368, "Editorial Sudamericana"],
    "Великий Гэтсби": ["Фрэнсиса Скотта Фицджеральда", "роман", 1925, 256, "Scribner's"],

}
pprint(book_collection)
pprint(book_collection["Винни Пух"])

#============== Удаление ==============
del book_collection["Великий Гэтсби"]
pprint(book_collection)

#=============== Поиск ================
pprint(book_collection["Унесённые ветром"])
pprint(book_collection.get("Унесённые ветром"))
pprint(book_collection.get("Унесённые ветром"))

#============= Добавление =============
new_book_collection = {
    "Портрет Дориана Грея": ["О.Уальд", "роман", 1890, 450, "Lippincott's Monthly Magazine"]
}
book_collection.update(new_book_collection)
pprint(book_collection)

#============ Замена данных ============
pprint(book_collection["Винни Пух"])
book_collection["Винни Пух"] = ["Джоан Роулинг", "фэнтэзи", 2000, 550, "George Allen & Unwin"]
pprint(book_collection)

########################
#Вывод
#######################

# {'Великий Гэтсби': ['Фрэнсиса Скотта Фицджеральда',
#                     'роман',
#                     1925,
#                     256,
#                     "Scribner's"],
#  'Винни Пух': ['Алан Александр Милн', 'стихи', 1926, 400, 'Лондон ивнинг ньюс'],
#  'Властелин Колец': ['Джон Толкин',
#                      'фэнтэзи',
#                      1955,
#                      1200,
#                      'George Allen & Unwin'],
#  'Сто лет одиночества': ['Габриэль Гарсиа Маркес',
#                          'магический реализм',
#                          1967,
#                          368,
#                          'Editorial Sudamericana'],
#  'Унесённые ветром': ['Маргарет Митчелл',
#                       'роман',
#                       1936,
#                       1080,
#                       'New York: Pocket books']}
# ['Алан Александр Милн', 'стихи', 1926, 400, 'Лондон ивнинг ньюс']
# {'Винни Пух': ['Алан Александр Милн', 'стихи', 1926, 400, 'Лондон ивнинг ньюс'],
#  'Властелин Колец': ['Джон Толкин',
#                      'фэнтэзи',
#                      1955,
#                      1200,
#                      'George Allen & Unwin'],
#  'Сто лет одиночества': ['Габриэль Гарсиа Маркес',
#                          'магический реализм',
#                          1967,
#                          368,
#                          'Editorial Sudamericana'],
#  'Унесённые ветром': ['Маргарет Митчелл',
#                       'роман',
#                       1936,
#                       1080,
#                       'New York: Pocket books']}
# ['Маргарет Митчелл', 'роман', 1936, 1080, 'New York: Pocket books']
# ['Маргарет Митчелл', 'роман', 1936, 1080, 'New York: Pocket books']
# ['Маргарет Митчелл', 'роман', 1936, 1080, 'New York: Pocket books']
# {'Винни Пух': ['Алан Александр Милн', 'стихи', 1926, 400, 'Лондон ивнинг ньюс'],
#  'Властелин Колец': ['Джон Толкин',
#                      'фэнтэзи',
#                      1955,
#                      1200,
#                      'George Allen & Unwin'],
#  'Портрет Дориана Грея': ['О.Уальд',
#                           'роман',
#                           1890,
#                           450,
#                           "Lippincott's Monthly Magazine"],
#  'Сто лет одиночества': ['Габриэль Гарсиа Маркес',
#                          'магический реализм',
#                          1967,
#                          368,
#                          'Editorial Sudamericana'],
#  'Унесённые ветром': ['Маргарет Митчелл',
#                       'роман',
#                       1936,
#                       1080,
#                       'New York: Pocket books']}
# ['Алан Александр Милн', 'стихи', 1926, 400, 'Лондон ивнинг ньюс']
# {'Винни Пух': ['Джоан Роулинг', 'фэнтэзи', 2000, 550, 'George Allen & Unwin'],
#  'Властелин Колец': ['Джон Толкин',
#                      'фэнтэзи',
#                      1955,
#                      1200,
#                      'George Allen & Unwin'],
#  'Портрет Дориана Грея': ['О.Уальд',
#                           'роман',
#                           1890,
#                           450,
#                           "Lippincott's Monthly Magazine"],
#  'Сто лет одиночества': ['Габриэль Гарсиа Маркес',
#                          'магический реализм',
#                          1967,
#                          368,
#                          'Editorial Sudamericana'],
#  'Унесённые ветром': ['Маргарет Митчелл',
#                       'роман',
#                       1936,
#                       1080,
#                       'New York: Pocket books']}