a1 = (5, 10, 15, 20)
a2 = (2, 4, 6, 8, 10)
a3 = (10, 20, 30, 40, 50)
print(a1)
print(a2)
print(a3)

###############################################
# ====== Элементы, которые есть во всех кортежах
###############################################

a = list(set(a1) & set(a2) & set(a3))
print(a)

#######################################################
# ======= Элементы, которые уникальны для каждого списка
########################################################

unique_numbers_1 = set(a1) - set(a2) - set(a3)
unique_numbers_2 = set(a2) - set(a1) - set(a3)
unique_numbers_3 = set(a3) - set(a2) - set(a1)
print(unique_numbers_1, unique_numbers_2, unique_numbers_3)

########################################################################################################
# ======= Элементы, которые есть в каждом из кортежей и находятся в каждом из кортежей на той же позиции
########################################################################################################

print(a1[2])
print(a2[2])
print(a3[2])

######################
#Вывод
#####################

# (5, 10, 15, 20)
# (2, 4, 6, 8, 10)
# (10, 20, 30, 40, 50)
# [10]
# {5, 15} {8, 2, 4, 6} {40, 50, 30}
# 15
# 6
# 30