######################################################################################
#Задание 1
#Напишите функцию, вычисляющую произведение элементов списка целых.
#Список передаётся в качестве параметра. Полученный результат возвращается из функции.
#######################################################################################
a = int(input("Число №1:"))
b = int(input("Число №2:"))

def hak_1 (a, b):
    print ("Сумма чисел a + b :", a + b)

hak_1(a, b)

def test_1 (x):
    print("Сумма чисел из списка:", x+i)
for i in range (1, 11):
    test_1(i)
#############
#Вывод
#############

# Число №1:25
# Число №2:25
# Сумма чисел a + b : 50
# Сумма чисел из списка: 2
# Сумма чисел из списка: 4
# Сумма чисел из списка: 6
# Сумма чисел из списка: 8
# Сумма чисел из списка: 10
# Сумма чисел из списка: 12
# Сумма чисел из списка: 14
# Сумма чисел из списка: 16
# Сумма чисел из списка: 18
# Сумма чисел из списка: 20