list_1 = [1, 5, 25, 35]
list_2 = [10, 15, 20, 25, 30]
s = 2

print(f"Список целых элементов:{list_1}")

# ==================================================================
# === Функция, вычисляющая произведение элементов списка целых======
# ==================================================================
def Proizvedenie (list_1):
    res = 1
    for i in list_1:
        if i != 0:
            res *= i
        else:
            res == 0
            print(f"роизвидение списка целых равняется нулю")
            break
    return f"Прозвидение целых чисел. Вариант_1: {res}"
print(Proizvedenie(list_1))

# ==================================================================
# ============ Функция для нахождения минимума в списке целых ======
# ==================================================================

def minimum (list_1):
    return f"Минимаотное значение списка целых чисел:{min(list_1)}"
print(minimum (list_1))

# ==================================================================
# ============ Функция для нахождения максимума в списке целых =====
# ==================================================================
def maksimym (list_1):
    return f"Максимальное значение в списке {max(list_1)}"
print(maksimym (list_1))

# ==================================================================
# === Функция для нахождения количества простых чисел в списке =====
# ==================================================================

def dlina (list_1):
    return f"Количество целых чисел: {len(list_1)}"

print (dlina (list_1))

# ==================================================================
# == Функция, удаляющая из списка целых некоторое заданное числох ==
# ==================================================================

def dell_1 (list_1):
    i = list_1.index(1)
    remuved_item = list_1.pop (i)
    return f"Удаление из списка заданное число: {len(list_1)}"
print (dell_1 (list_1))

# # ==================================================================
# # ==================== Объединение списков =========================
# # ==================================================================

def Cymma (list_1, list_2):
    return f"Обьединение списков целых чисел: {list_1 + list_2}"
print (Cymma (list_1, list_2))

# # ==================================================================
# # ==== Функция, высчитывающая степень каждого элемента списка ======
# # ==================================================================

def p(list_1, s):
    new_list = []
    for i in list_1:
        new_list.append(i ** s)
    return f"Новый список, где каждый элемент находится в степени {s}: {new_list}"

print(p(list_1, s))


#=====================================================================
#==========================Вывод======================================
#=====================================================================
# Список целых элементов:[1, 5, 25, 35]
# Прозвидение целых чисел. Вариант_1: 4375
# Минимаотное значение списка целых чисел:1
# Максимальное значение в списке 35
# Количество целых чисел: 4
# Удаление из списка заданное число: 3
# Обьединение списков целых чисел: [5, 25, 35, 10, 15, 20, 25, 30]
# Новый список, где каждый элемент находится в степени 2: [25, 625, 1225]
